uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_ppa.c
/****************************************************************************
 * arch/risc-v/src/esp32p4/esp32p4_ppa.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/mutex.h>

#include "soc/hp_sys_clkrst_struct.h"
#include "soc/ppa_struct.h"
#include "soc/ppa_reg.h"
#include "soc/dma2d_channel.h"
#include "hal/ppa_types.h"
#include "hal/ppa_ll.h"
#include "hal/ppa_hal.h"
#include "hal/dma2d_types.h"
#include "esp_cache.h"
#include "esp32p4_dma2d.h"
#include "esp32p4_ppa.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define PPA_TIMEOUT_US 500000

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct esp32p4_ppa_dev_s
{
  mutex_t           lock;
  bool              initialized;
  ppa_hal_context_t hal;
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct esp32p4_ppa_dev_s g_ppa_dev =
{
  .lock = NXMUTEX_INITIALIZER,
  .initialized = false,
};

static dma2d_descriptor_t g_tx_desc[2] __attribute__((aligned(8)));
static dma2d_descriptor_t g_rx_desc    __attribute__((aligned(8)));

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32p4_ppa_to_srm_cm
 ****************************************************************************/

static inline ppa_srm_color_mode_t esp32p4_ppa_to_srm_cm(int color_fmt)
{
  switch (color_fmt)
    {
      case ESP32P4_PPA_COLOR_RGB565:
        return PPA_SRM_COLOR_MODE_RGB565;

      case ESP32P4_PPA_COLOR_RGB888:
        return PPA_SRM_COLOR_MODE_RGB888;

      case ESP32P4_PPA_COLOR_ARGB8888:
        return PPA_SRM_COLOR_MODE_ARGB8888;

      case ESP32P4_PPA_COLOR_GRAY8:
        return PPA_SRM_COLOR_MODE_GRAY8;

      case ESP32P4_PPA_COLOR_YUV420:
        return PPA_SRM_COLOR_MODE_YUV420;

      case ESP32P4_PPA_COLOR_YUV422:
      default:
        return PPA_SRM_COLOR_MODE_YUV422_UYVY;
    }
}

/****************************************************************************
 * Name: esp32p4_ppa_to_blend_cm
 ****************************************************************************/

static inline ppa_blend_color_mode_t esp32p4_ppa_to_blend_cm(int color_fmt)
{
  switch (color_fmt)
    {
      case ESP32P4_PPA_COLOR_RGB565:
        return PPA_BLEND_COLOR_MODE_RGB565;

      case ESP32P4_PPA_COLOR_RGB888:
        return PPA_BLEND_COLOR_MODE_RGB888;

      case ESP32P4_PPA_COLOR_ARGB8888:
        return PPA_BLEND_COLOR_MODE_ARGB8888;

      case ESP32P4_PPA_COLOR_GRAY8:
        return PPA_BLEND_COLOR_MODE_GRAY8;

      case ESP32P4_PPA_COLOR_YUV420:
        return PPA_BLEND_COLOR_MODE_YUV420;

      case ESP32P4_PPA_COLOR_YUV422:
      default:
        return PPA_BLEND_COLOR_MODE_YUV422_UYVY;
    }
}

/****************************************************************************
 * Name: esp32p4_ppa_to_fill_cm
 ****************************************************************************/

static inline ppa_fill_color_mode_t esp32p4_ppa_to_fill_cm(int color_fmt)
{
  switch (color_fmt)
    {
      case ESP32P4_PPA_COLOR_RGB565:
        return PPA_FILL_COLOR_MODE_RGB565;

      case ESP32P4_PPA_COLOR_RGB888:
        return PPA_FILL_COLOR_MODE_RGB888;

      case ESP32P4_PPA_COLOR_ARGB8888:
        return PPA_FILL_COLOR_MODE_ARGB8888;

      case ESP32P4_PPA_COLOR_GRAY8:
        return PPA_FILL_COLOR_MODE_GRAY8;

      case ESP32P4_PPA_COLOR_YUV422:
      default:
        return PPA_FILL_COLOR_MODE_YUV422_UYVY;
    }
}

/****************************************************************************
 * Name: esp32p4_ppa_get_pbyte
 ****************************************************************************/

static inline uint32_t esp32p4_ppa_get_pbyte(int color_fmt)
{
  switch (color_fmt)
    {
      case ESP32P4_PPA_COLOR_GRAY8:
        return DMA2D_DESCRIPTOR_PBYTE_1B0_PER_PIXEL;

      case ESP32P4_PPA_COLOR_RGB565:
      case ESP32P4_PPA_COLOR_YUV422:
        return DMA2D_DESCRIPTOR_PBYTE_2B0_PER_PIXEL;

      case ESP32P4_PPA_COLOR_RGB888:
        return DMA2D_DESCRIPTOR_PBYTE_3B0_PER_PIXEL;

      case ESP32P4_PPA_COLOR_ARGB8888:
        return DMA2D_DESCRIPTOR_PBYTE_4B0_PER_PIXEL;

      case ESP32P4_PPA_COLOR_YUV420:
        return DMA2D_DESCRIPTOR_PBYTE_1B5_PER_PIXEL;

      default:
        return DMA2D_DESCRIPTOR_PBYTE_2B0_PER_PIXEL;
    }
}

/****************************************************************************
 * Name: esp32p4_ppa_get_bpp
 ****************************************************************************/

static inline size_t esp32p4_ppa_get_bpp(int color_fmt)
{
  switch (color_fmt)
    {
      case ESP32P4_PPA_COLOR_GRAY8:
        return 1;

      case ESP32P4_PPA_COLOR_RGB565:
      case ESP32P4_PPA_COLOR_YUV422:
        return 2;

      case ESP32P4_PPA_COLOR_RGB888:
        return 3;

      case ESP32P4_PPA_COLOR_ARGB8888:
        return 4;

      case ESP32P4_PPA_COLOR_YUV420:
        return 2;

      default:
        return 2;
    }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32p4_ppa_init
 ****************************************************************************/

int esp32p4_ppa_init(void)
{
  nxmutex_lock(&g_ppa_dev.lock);

  if (g_ppa_dev.initialized)
    {
      nxmutex_unlock(&g_ppa_dev.lock);
      return OK;
    }

  /* Initialize underlying 2D-DMA controller */

