uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_ppa.c
  esp32p4_dma2d_init();

  /* Enable PPA bus clock in HP System Clock & Reset controller */

  HP_SYS_CLKRST.soc_clk_ctrl1.reg_ppa_sys_clk_en = 1;

  /* Reset PPA hardware module */

  HP_SYS_CLKRST.hp_rst_en1.reg_rst_en_ppa = 1;
  HP_SYS_CLKRST.hp_rst_en1.reg_rst_en_ppa = 0;

  /* Initialize HAL context */

  ppa_hal_init(&g_ppa_dev.hal);

  g_ppa_dev.initialized = true;

  nxmutex_unlock(&g_ppa_dev.lock);
  return OK;
}

/****************************************************************************
 * Name: esp32p4_ppa_deinit
 ****************************************************************************/

int esp32p4_ppa_deinit(void)
{
  nxmutex_lock(&g_ppa_dev.lock);

  if (!g_ppa_dev.initialized)
    {
      nxmutex_unlock(&g_ppa_dev.lock);
      return OK;
    }

  /* Disable PPA bus clock to save power */

  HP_SYS_CLKRST.soc_clk_ctrl1.reg_ppa_sys_clk_en = 0;

  ppa_hal_deinit(&g_ppa_dev.hal);

  g_ppa_dev.initialized = false;

  nxmutex_unlock(&g_ppa_dev.lock);
  return OK;
}

/****************************************************************************
 * Name: esp32p4_ppa_scale
 ****************************************************************************/

int esp32p4_ppa_scale(const void *src, uint16_t src_w, uint16_t src_h,
                      void *dst, uint16_t dst_w, uint16_t dst_h,
                      int color_fmt)
{
  if (src == NULL || dst == NULL || src_w == 0 || src_h == 0 ||
      dst_w == 0 || dst_h == 0)
    {
      return -EINVAL;
    }

  if (!g_ppa_dev.initialized)
    {
      int ret = esp32p4_ppa_init();
      if (ret < 0)
        {
          return ret;
        }
    }

  nxmutex_lock(&g_ppa_dev.lock);

  size_t src_size = (size_t)src_w * src_h * esp32p4_ppa_get_bpp(color_fmt);
  size_t dst_size = (size_t)dst_w * dst_h * esp32p4_ppa_get_bpp(color_fmt);

  /* Flush CPU cache for source and prepare destination */

  esp_cache_msync((void *)src, src_size, ESP_CACHE_MSYNC_FLAG_DIR_C2M);
  esp_cache_msync((void *)dst, dst_size, ESP_CACHE_MSYNC_FLAG_DIR_M2C);

  /* Prepare 2D-DMA TX descriptor (Input to SRM) */

  memset(&g_tx_desc[0], 0, sizeof(dma2d_descriptor_t));
  g_tx_desc[0].vb_size   = src_h;
  g_tx_desc[0].hb_length = src_w;
  g_tx_desc[0].dma2d_en  = 1;
  g_tx_desc[0].suc_eof   = 1;
  g_tx_desc[0].owner     = DMA2D_DESCRIPTOR_BUFFER_OWNER_DMA;
  g_tx_desc[0].va_size   = src_h;
  g_tx_desc[0].ha_length = src_w;
  g_tx_desc[0].pbyte     = esp32p4_ppa_get_pbyte(color_fmt);
  g_tx_desc[0].mode      = DMA2D_DESCRIPTOR_BLOCK_RW_MODE_SINGLE;
  g_tx_desc[0].buffer    = (void *)src;
  g_tx_desc[0].next      = NULL;

  /* Prepare 2D-DMA RX descriptor (Output from SRM) */

  memset(&g_rx_desc, 0, sizeof(dma2d_descriptor_t));
  g_rx_desc.vb_size   = 2;
  g_rx_desc.hb_length = 2;
  g_rx_desc.dma2d_en  = 1;
  g_rx_desc.suc_eof   = 1;
  g_rx_desc.owner     = DMA2D_DESCRIPTOR_BUFFER_OWNER_DMA;
  g_rx_desc.va_size   = dst_h;
  g_rx_desc.ha_length = dst_w;
  g_rx_desc.pbyte     = esp32p4_ppa_get_pbyte(color_fmt);
  g_rx_desc.mode      = DMA2D_DESCRIPTOR_BLOCK_RW_MODE_SINGLE;
  g_rx_desc.buffer    = (void *)dst;
  g_rx_desc.next      = NULL;

  esp_cache_msync(&g_tx_desc[0], sizeof(dma2d_descriptor_t),
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M);
  esp_cache_msync(&g_rx_desc, sizeof(dma2d_descriptor_t),
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M);

  /* Configure 2D-DMA Channels */

  esp32p4_dma2d_setup_tx(0, DMA2D_TRIG_PERIPH_PPA_SRM,
                         SOC_DMA2D_TRIG_PERIPH_PPA_SRM_TX,
                         &g_tx_desc[0], DMA2D_DATA_BURST_LENGTH_128);

  esp32p4_dma2d_setup_rx(0, DMA2D_TRIG_PERIPH_PPA_SRM,
                         SOC_DMA2D_TRIG_PERIPH_PPA_SRM_RX,
                         &g_rx_desc, DMA2D_DATA_BURST_LENGTH_128);

  ppa_srm_color_mode_t ppa_cm = esp32p4_ppa_to_srm_cm(color_fmt);
  uint32_t blk_h = 0;
  uint32_t blk_v = 0;
  ppa_ll_srm_get_dma_dscr_port_mode_block_size(&PPA, ppa_cm,
                                               ppa_ll_srm_get_mb_size(&PPA),
                                               &blk_h, &blk_v);
  esp32p4_dma2d_enable_tx_dscr_port(0, blk_h, blk_v);

  esp32p4_dma2d_start_tx(0);
  esp32p4_dma2d_start_rx(0);

  /* Configure PPA SRM hardware engine */

  ppa_ll_srm_reset(&PPA);
  ppa_ll_srm_set_rx_color_mode(&PPA, ppa_cm);
  ppa_ll_srm_set_tx_color_mode(&PPA, ppa_cm);
  ppa_ll_srm_set_rotation_angle(&PPA, PPA_SRM_ROTATION_ANGLE_0);

  uint32_t scale_x_int = (uint32_t)(dst_w / src_w);
  uint32_t scale_x_frag =
    ((uint64_t)(dst_w % src_w) * PPA_LL_SRM_SCALING_FRAG_MAX) / src_w;
  uint32_t scale_y_int = (uint32_t)(dst_h / src_h);
  uint32_t scale_y_frag =
    ((uint64_t)(dst_h % src_h) * PPA_LL_SRM_SCALING_FRAG_MAX) / src_h;

  ppa_ll_srm_set_scaling_x(&PPA, scale_x_int, scale_x_frag);
  ppa_ll_srm_set_scaling_y(&PPA, scale_y_int, scale_y_frag);
  ppa_ll_srm_enable_mirror_x(&PPA, false);
  ppa_ll_srm_enable_mirror_y(&PPA, false);

  /* Hardware bug workaround (DIG-734) */

  uint32_t w_out = src_w * scale_x_int +
                   src_w * scale_x_frag / PPA_LL_SRM_SCALING_FRAG_MAX;
  uint32_t w_divisor = (ppa_cm == PPA_SRM_COLOR_MODE_ARGB8888 ||
                        ppa_cm == PPA_SRM_COLOR_MODE_RGB888) ? 32 : 64;
  uint32_t w_left = w_out % w_divisor;
  w_left = (w_left == 0) ? w_divisor : w_left;
  uint32_t h_mb =
    (ppa_ll_srm_get_mb_size(&PPA) == PPA_LL_SRM_MB_SIZE_16_16) ? 16 : 32;
  uint32_t h_in_left = src_h % h_mb;
  h_in_left = (h_in_left == 0) ? h_mb : h_in_left;
  uint32_t h_left = h_in_left * scale_y_int +
                    h_in_left * scale_y_frag / PPA_LL_SRM_SCALING_FRAG_MAX;
  const uint32_t dma2d_fifo_depth_bits = 12 * 128;
  uint32_t out_pixel_depth = (uint32_t)esp32p4_ppa_get_bpp(color_fmt) * 8;
  bool bypass_mb_order = false;
  if (((w_out > w_divisor) || (src_h > h_mb)) &&
      ((w_left * h_left * out_pixel_depth) < dma2d_fifo_depth_bits))
    {
      bypass_mb_order = true;
    }

  ppa_ll_srm_bypass_mb_order(&PPA, bypass_mb_order);

  /* Trigger PPA SRM hardware acceleration */

  ppa_ll_srm_start(&PPA);

  /* Wait for 2D-DMA transfer completion */

  int ret = esp32p4_dma2d_wait_rx_done(0, PPA_TIMEOUT_US);

  esp32p4_dma2d_stop_tx(0);
  esp32p4_dma2d_stop_rx(0);

