uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_ppa.c
  /* Invalidate CPU cache for destination buffer */

  esp_cache_msync((void *)dst, dst_size, ESP_CACHE_MSYNC_FLAG_DIR_M2C);

  nxmutex_unlock(&g_ppa_dev.lock);
  return ret;
}

/****************************************************************************
 * Name: esp32p4_ppa_rotate
 ****************************************************************************/

int esp32p4_ppa_rotate(const void *src, uint16_t w, uint16_t h,
                       void *dst, int rotation, int color_fmt)
{
  if (src == NULL || dst == NULL || w == 0 || h == 0)
    {
      return -EINVAL;
    }

  if (!g_ppa_dev.initialized)
    {
      int ret = esp32p4_ppa_init();
      if (ret < 0)
        {
          return ret;
        }
    }

  nxmutex_lock(&g_ppa_dev.lock);

  uint16_t dst_w = (rotation == ESP32P4_PPA_ROT_90 ||
                    rotation == ESP32P4_PPA_ROT_270) ? h : w;
  uint16_t dst_h = (rotation == ESP32P4_PPA_ROT_90 ||
                    rotation == ESP32P4_PPA_ROT_270) ? w : h;

  size_t src_size = (size_t)w * h * esp32p4_ppa_get_bpp(color_fmt);
  size_t dst_size = (size_t)dst_w * dst_h * esp32p4_ppa_get_bpp(color_fmt);

  esp_cache_msync((void *)src, src_size, ESP_CACHE_MSYNC_FLAG_DIR_C2M);
  esp_cache_msync((void *)dst, dst_size, ESP_CACHE_MSYNC_FLAG_DIR_M2C);

  /* Prepare 2D-DMA TX descriptor */

  memset(&g_tx_desc[0], 0, sizeof(dma2d_descriptor_t));
  g_tx_desc[0].vb_size   = h;
  g_tx_desc[0].hb_length = w;
  g_tx_desc[0].dma2d_en  = 1;
  g_tx_desc[0].suc_eof   = 1;
  g_tx_desc[0].owner     = DMA2D_DESCRIPTOR_BUFFER_OWNER_DMA;
  g_tx_desc[0].va_size   = h;
  g_tx_desc[0].ha_length = w;
  g_tx_desc[0].pbyte     = esp32p4_ppa_get_pbyte(color_fmt);
  g_tx_desc[0].mode      = DMA2D_DESCRIPTOR_BLOCK_RW_MODE_SINGLE;
  g_tx_desc[0].buffer    = (void *)src;
  g_tx_desc[0].next      = NULL;

  /* Prepare 2D-DMA RX descriptor */

  memset(&g_rx_desc, 0, sizeof(dma2d_descriptor_t));
  g_rx_desc.vb_size   = 2;
  g_rx_desc.hb_length = 2;
  g_rx_desc.dma2d_en  = 1;
  g_rx_desc.suc_eof   = 1;
  g_rx_desc.owner     = DMA2D_DESCRIPTOR_BUFFER_OWNER_DMA;
  g_rx_desc.va_size   = dst_h;
  g_rx_desc.ha_length = dst_w;
  g_rx_desc.pbyte     = esp32p4_ppa_get_pbyte(color_fmt);
  g_rx_desc.mode      = DMA2D_DESCRIPTOR_BLOCK_RW_MODE_SINGLE;
  g_rx_desc.buffer    = (void *)dst;
  g_rx_desc.next      = NULL;

  esp_cache_msync(&g_tx_desc[0], sizeof(dma2d_descriptor_t),
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M);
  esp_cache_msync(&g_rx_desc, sizeof(dma2d_descriptor_t),
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M);

  esp32p4_dma2d_setup_tx(0, DMA2D_TRIG_PERIPH_PPA_SRM,
                         SOC_DMA2D_TRIG_PERIPH_PPA_SRM_TX,
                         &g_tx_desc[0], DMA2D_DATA_BURST_LENGTH_128);

  esp32p4_dma2d_setup_rx(0, DMA2D_TRIG_PERIPH_PPA_SRM,
                         SOC_DMA2D_TRIG_PERIPH_PPA_SRM_RX,
                         &g_rx_desc, DMA2D_DATA_BURST_LENGTH_128);

  ppa_srm_color_mode_t ppa_cm = esp32p4_ppa_to_srm_cm(color_fmt);
  uint32_t blk_h = 0;
  uint32_t blk_v = 0;
  ppa_ll_srm_get_dma_dscr_port_mode_block_size(&PPA, ppa_cm,
                                               ppa_ll_srm_get_mb_size(&PPA),
                                               &blk_h, &blk_v);
  esp32p4_dma2d_enable_tx_dscr_port(0, blk_h, blk_v);

  esp32p4_dma2d_start_tx(0);
  esp32p4_dma2d_start_rx(0);

  ppa_ll_srm_reset(&PPA);
  ppa_ll_srm_set_rx_color_mode(&PPA, ppa_cm);
  ppa_ll_srm_set_tx_color_mode(&PPA, ppa_cm);
  ppa_ll_srm_set_rotation_angle(&PPA, (ppa_srm_rotation_angle_t)rotation);
  ppa_ll_srm_set_scaling_x(&PPA, 1, 0);
  ppa_ll_srm_set_scaling_y(&PPA, 1, 0);
  ppa_ll_srm_enable_mirror_x(&PPA, false);
  ppa_ll_srm_enable_mirror_y(&PPA, false);

  ppa_ll_srm_start(&PPA);

  int ret = esp32p4_dma2d_wait_rx_done(0, PPA_TIMEOUT_US);

  esp32p4_dma2d_stop_tx(0);
  esp32p4_dma2d_stop_rx(0);

  esp_cache_msync((void *)dst, dst_size, ESP_CACHE_MSYNC_FLAG_DIR_M2C);

  nxmutex_unlock(&g_ppa_dev.lock);
  return ret;
}

/****************************************************************************
 * Name: esp32p4_ppa_blend
 ****************************************************************************/

int esp32p4_ppa_blend(const void *bg, const void *fg, void *dst,
                      uint16_t w, uint16_t h, uint8_t alpha,
                      int color_fmt)
{
  if (bg == NULL || fg == NULL || dst == NULL || w == 0 || h == 0)
    {
      return -EINVAL;
    }

  if (!g_ppa_dev.initialized)
    {
      int ret = esp32p4_ppa_init();
      if (ret < 0)
        {
          return ret;
        }
    }

  nxmutex_lock(&g_ppa_dev.lock);

  size_t img_size = (size_t)w * h * esp32p4_ppa_get_bpp(color_fmt);

  esp_cache_msync((void *)bg, img_size, ESP_CACHE_MSYNC_FLAG_DIR_C2M);
  esp_cache_msync((void *)fg, img_size, ESP_CACHE_MSYNC_FLAG_DIR_C2M);
  esp_cache_msync((void *)dst, img_size, ESP_CACHE_MSYNC_FLAG_DIR_M2C);

  /* TX BG descriptor on TX CH1 */

  memset(&g_tx_desc[0], 0, sizeof(dma2d_descriptor_t));
  g_tx_desc[0].vb_size   = h;
  g_tx_desc[0].hb_length = w;
  g_tx_desc[0].dma2d_en  = 1;
  g_tx_desc[0].suc_eof   = 1;
  g_tx_desc[0].owner     = DMA2D_DESCRIPTOR_BUFFER_OWNER_DMA;
  g_tx_desc[0].va_size   = h;
  g_tx_desc[0].ha_length = w;
  g_tx_desc[0].pbyte     = esp32p4_ppa_get_pbyte(color_fmt);
  g_tx_desc[0].mode      = DMA2D_DESCRIPTOR_BLOCK_RW_MODE_SINGLE;
  g_tx_desc[0].buffer    = (void *)bg;
  g_tx_desc[0].next      = NULL;

  /* TX FG descriptor on TX CH2 */

  memset(&g_tx_desc[1], 0, sizeof(dma2d_descriptor_t));
  g_tx_desc[1].vb_size   = h;
  g_tx_desc[1].hb_length = w;
  g_tx_desc[1].dma2d_en  = 1;
  g_tx_desc[1].suc_eof   = 1;
  g_tx_desc[1].owner     = DMA2D_DESCRIPTOR_BUFFER_OWNER_DMA;
  g_tx_desc[1].va_size   = h;
  g_tx_desc[1].ha_length = w;
  g_tx_desc[1].pbyte     = esp32p4_ppa_get_pbyte(color_fmt);
  g_tx_desc[1].mode      = DMA2D_DESCRIPTOR_BLOCK_RW_MODE_SINGLE;
  g_tx_desc[1].buffer    = (void *)fg;
  g_tx_desc[1].next      = NULL;

  /* RX descriptor on RX CH0 */

  memset(&g_rx_desc, 0, sizeof(dma2d_descriptor_t));
  g_rx_desc.vb_size   = h;
  g_rx_desc.hb_length = w;
  g_rx_desc.dma2d_en  = 1;
  g_rx_desc.suc_eof   = 1;
  g_rx_desc.owner     = DMA2D_DESCRIPTOR_BUFFER_OWNER_DMA;
  g_rx_desc.va_size   = h;
  g_rx_desc.ha_length = w;
  g_rx_desc.pbyte     = esp32p4_ppa_get_pbyte(color_fmt);
  g_rx_desc.mode      = DMA2D_DESCRIPTOR_BLOCK_RW_MODE_SINGLE;
  g_rx_desc.buffer    = (void *)dst;
  g_rx_desc.next      = NULL;

  esp_cache_msync(&g_tx_desc[0], sizeof(dma2d_descriptor_t) * 2,
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M);
  esp_cache_msync(&g_rx_desc, sizeof(dma2d_descriptor_t),
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M);

  /* Setup 2D-DMA Channels: BG on TX1, FG on TX2, Output on RX0 */

  esp32p4_dma2d_setup_tx(1, DMA2D_TRIG_PERIPH_PPA_BLEND,
                         SOC_DMA2D_TRIG_PERIPH_PPA_BLEND_BG_TX,
                         &g_tx_desc[0], DMA2D_DATA_BURST_LENGTH_128);

  esp32p4_dma2d_setup_tx(2, DMA2D_TRIG_PERIPH_PPA_BLEND,
                         SOC_DMA2D_TRIG_PERIPH_PPA_BLEND_FG_TX,
                         &g_tx_desc[1], DMA2D_DATA_BURST_LENGTH_128);

  esp32p4_dma2d_setup_rx(0, DMA2D_TRIG_PERIPH_PPA_BLEND,
                         SOC_DMA2D_TRIG_PERIPH_PPA_BLEND_RX,
                         &g_rx_desc, DMA2D_DATA_BURST_LENGTH_128);

