uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_ppa.c
  esp32p4_dma2d_start_tx(1);
  esp32p4_dma2d_start_tx(2);
  esp32p4_dma2d_start_rx(0);

  /* Configure PPA Blend Engine */

  ppa_blend_color_mode_t ppa_bcm = esp32p4_ppa_to_blend_cm(color_fmt);
  ppa_ll_blend_reset(&PPA);
  ppa_ll_blend_set_rx_bg_color_mode(&PPA, ppa_bcm);
  ppa_ll_blend_configure_rx_bg_alpha(&PPA, PPA_ALPHA_FIX_VALUE,
                                     255 - alpha);
  ppa_ll_blend_set_rx_fg_color_mode(&PPA, ppa_bcm);
  ppa_ll_blend_configure_rx_fg_alpha(&PPA, PPA_ALPHA_FIX_VALUE, alpha);
  ppa_ll_blend_set_tx_color_mode(&PPA, ppa_bcm);

  ppa_ll_blend_start(&PPA, PPA_LL_BLEND_TRANS_MODE_BLEND);

  int ret = esp32p4_dma2d_wait_rx_done(0, PPA_TIMEOUT_US);

  esp32p4_dma2d_stop_tx(1);
  esp32p4_dma2d_stop_tx(2);
  esp32p4_dma2d_stop_rx(0);

  esp_cache_msync((void *)dst, img_size, ESP_CACHE_MSYNC_FLAG_DIR_M2C);

  nxmutex_unlock(&g_ppa_dev.lock);
  return ret;
}

/****************************************************************************
 * Name: esp32p4_ppa_fill
 ****************************************************************************/

int esp32p4_ppa_fill(void *dst, uint16_t w, uint16_t h,
                     uint32_t color, int color_fmt)
{
  if (dst == NULL || w == 0 || h == 0)
    {
      return -EINVAL;
    }

  if (!g_ppa_dev.initialized)
    {
      int ret = esp32p4_ppa_init();
      if (ret < 0)
        {
          return ret;
        }
    }

  nxmutex_lock(&g_ppa_dev.lock);

  size_t dst_size = (size_t)w * h * esp32p4_ppa_get_bpp(color_fmt);

  esp_cache_msync((void *)dst, dst_size, ESP_CACHE_MSYNC_FLAG_DIR_M2C);

  /* RX descriptor for destination */

  memset(&g_rx_desc, 0, sizeof(dma2d_descriptor_t));
  g_rx_desc.vb_size   = h;
  g_rx_desc.hb_length = w;
  g_rx_desc.dma2d_en  = 1;
  g_rx_desc.suc_eof   = 1;
  g_rx_desc.owner     = DMA2D_DESCRIPTOR_BUFFER_OWNER_DMA;
  g_rx_desc.va_size   = h;
  g_rx_desc.ha_length = w;
  g_rx_desc.pbyte     = esp32p4_ppa_get_pbyte(color_fmt);
  g_rx_desc.mode      = DMA2D_DESCRIPTOR_BLOCK_RW_MODE_SINGLE;
  g_rx_desc.buffer    = (void *)dst;
  g_rx_desc.next      = NULL;

  esp_cache_msync(&g_rx_desc, sizeof(dma2d_descriptor_t),
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M);

  esp32p4_dma2d_setup_rx(0, DMA2D_TRIG_PERIPH_PPA_BLEND,
                         SOC_DMA2D_TRIG_PERIPH_PPA_BLEND_RX,
                         &g_rx_desc, DMA2D_DATA_BURST_LENGTH_128);

  esp32p4_dma2d_start_rx(0);

  /* Configure PPA Blend Engine in Fill Mode */

  ppa_fill_color_mode_t ppa_fcm = esp32p4_ppa_to_fill_cm(color_fmt);
  ppa_ll_blend_reset(&PPA);
  ppa_ll_blend_configure_filling_block(&PPA, ppa_fcm, (void *)&color, w, h);
  ppa_ll_blend_set_tx_color_mode(&PPA, (ppa_blend_color_mode_t)ppa_fcm);

  ppa_ll_blend_start(&PPA, PPA_LL_BLEND_TRANS_MODE_FILL);

  int ret = esp32p4_dma2d_wait_rx_done(0, PPA_TIMEOUT_US);

  esp32p4_dma2d_stop_rx(0);

  esp_cache_msync((void *)dst, dst_size, ESP_CACHE_MSYNC_FLAG_DIR_M2C);

  nxmutex_unlock(&g_ppa_dev.lock);
  return ret;
}

/****************************************************************************
 * Name: esp32p4_ppa_csc
 ****************************************************************************/

int esp32p4_ppa_csc(const void *src, void *dst, uint16_t w, uint16_t h,
                    int src_fmt, int dst_fmt)
{
  if (src == NULL || dst == NULL || w == 0 || h == 0)
    {
      return -EINVAL;
    }

  if (!g_ppa_dev.initialized)
    {
      int ret = esp32p4_ppa_init();
      if (ret < 0)
        {
          return ret;
        }
    }

  nxmutex_lock(&g_ppa_dev.lock);

  size_t src_size = (size_t)w * h * esp32p4_ppa_get_bpp(src_fmt);
  size_t dst_size = (size_t)w * h * esp32p4_ppa_get_bpp(dst_fmt);

  esp_cache_msync((void *)src, src_size, ESP_CACHE_MSYNC_FLAG_DIR_C2M);
  esp_cache_msync((void *)dst, dst_size, ESP_CACHE_MSYNC_FLAG_DIR_M2C);

  /* TX descriptor on TX CH0 */

  memset(&g_tx_desc[0], 0, sizeof(dma2d_descriptor_t));
  g_tx_desc[0].vb_size   = h;
  g_tx_desc[0].hb_length = w;
  g_tx_desc[0].dma2d_en  = 1;
  g_tx_desc[0].suc_eof   = 1;
  g_tx_desc[0].owner     = DMA2D_DESCRIPTOR_BUFFER_OWNER_DMA;
  g_tx_desc[0].va_size   = h;
  g_tx_desc[0].ha_length = w;
  g_tx_desc[0].pbyte     = esp32p4_ppa_get_pbyte(src_fmt);
  g_tx_desc[0].mode      = DMA2D_DESCRIPTOR_BLOCK_RW_MODE_SINGLE;
  g_tx_desc[0].buffer    = (void *)src;
  g_tx_desc[0].next      = NULL;

  /* RX descriptor on RX CH0 */

  memset(&g_rx_desc, 0, sizeof(dma2d_descriptor_t));
  g_rx_desc.vb_size   = 2;
  g_rx_desc.hb_length = 2;
  g_rx_desc.dma2d_en  = 1;
  g_rx_desc.suc_eof   = 1;
  g_rx_desc.owner     = DMA2D_DESCRIPTOR_BUFFER_OWNER_DMA;
  g_rx_desc.va_size   = h;
  g_rx_desc.ha_length = w;
  g_rx_desc.pbyte     = esp32p4_ppa_get_pbyte(dst_fmt);
  g_rx_desc.mode      = DMA2D_DESCRIPTOR_BLOCK_RW_MODE_SINGLE;
  g_rx_desc.buffer    = (void *)dst;
  g_rx_desc.next      = NULL;

  esp_cache_msync(&g_tx_desc[0], sizeof(dma2d_descriptor_t),
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M);
  esp_cache_msync(&g_rx_desc, sizeof(dma2d_descriptor_t),
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M);

  esp32p4_dma2d_setup_tx(0, DMA2D_TRIG_PERIPH_PPA_SRM,
                         SOC_DMA2D_TRIG_PERIPH_PPA_SRM_TX,
                         &g_tx_desc[0], DMA2D_DATA_BURST_LENGTH_128);

  esp32p4_dma2d_setup_rx(0, DMA2D_TRIG_PERIPH_PPA_SRM,
                         SOC_DMA2D_TRIG_PERIPH_PPA_SRM_RX,
                         &g_rx_desc, DMA2D_DATA_BURST_LENGTH_128);

  ppa_srm_color_mode_t in_cm  = esp32p4_ppa_to_srm_cm(src_fmt);
  ppa_srm_color_mode_t out_cm = esp32p4_ppa_to_srm_cm(dst_fmt);

  uint32_t blk_h = 0;
  uint32_t blk_v = 0;
  ppa_ll_srm_get_dma_dscr_port_mode_block_size(&PPA, in_cm,
                                               ppa_ll_srm_get_mb_size(&PPA),
                                               &blk_h, &blk_v);
  esp32p4_dma2d_enable_tx_dscr_port(0, blk_h, blk_v);

  esp32p4_dma2d_start_tx(0);
  esp32p4_dma2d_start_rx(0);

  ppa_ll_srm_reset(&PPA);
  ppa_ll_srm_set_rx_color_mode(&PPA, in_cm);
  ppa_ll_srm_set_tx_color_mode(&PPA, out_cm);
  ppa_ll_srm_set_rotation_angle(&PPA, PPA_SRM_ROTATION_ANGLE_0);
  ppa_ll_srm_set_scaling_x(&PPA, 1, 0);
  ppa_ll_srm_set_scaling_y(&PPA, 1, 0);
  ppa_ll_srm_enable_mirror_x(&PPA, false);
  ppa_ll_srm_enable_mirror_y(&PPA, false);

  ppa_ll_srm_start(&PPA);

  int ret = esp32p4_dma2d_wait_rx_done(0, PPA_TIMEOUT_US);

  esp32p4_dma2d_stop_tx(0);
  esp32p4_dma2d_stop_rx(0);

  esp_cache_msync((void *)dst, dst_size, ESP_CACHE_MSYNC_FLAG_DIR_M2C);

  nxmutex_unlock(&g_ppa_dev.lock);
  return ret;
}
